       IDENTIFICATION DIVISION.
       PROGRAM-ID. COMBINED.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
        01 WS-NUM1 PIC 9(2) VALUE 20.
        01 WS-NUM2 PIC 9(2) VALUE 25.
        01 WS-NUM3 PIC 9(2) VALUE 20.
       PROCEDURE DIVISION.
            IF WS-NUM1 LESS THAN WS-NUM2 AND WS-NUM1 = WS-NUM3 THEN
              DISPLAY "BOTH CONDITION OK!".
            STOP RUN.
          
  
