       IDENTIFICATION DIVISION.
       PROGRAM-ID. COND.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
        01 WS-NUM1 PIC X(9) VALUE 'ABCDEF'.
        01 WS-NUM2 PIC 9(9) VALUE 12345.
       PROCEDURE DIVISION.
            IF WS-NUM1 IS ALPHABETIC THEN
              DISPLAY " WS-NUM1 IS ALPHABETIC".
            IF WS-NUM2 IS NUMERIC THEN
              DISPLAY " WS-NUM2 IS NUMERIC".
            STOP RUN.
