       IDENTIFICATION DIVISION.
       PROGRAM-ID. LOOPTIME.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
           A-PARA.
           PERFORM B-PARA 5 TIMES.
           STOP RUN.
           B-PARA.
           DISPLAY "HELLO COBOL".
