       IDENTIFICATION DIVISION.
       PROGRAM-ID. LOOPUNTL.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
        01 WS-A PIC 9 VALUE 0.
       PROCEDURE DIVISION.
           A-PARA.
           PERFORM B-PARA WITH TEST AFTER UNTIL WS-A > 3
           STOP RUN.
           B-PARA.
            DISPLAY "WS-A=" WS-A.
            ADD 1 TO WS-A.
