       IDENTIFICATION DIVISION.
       PROGRAM-ID. OPER.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
        01 WS-NUMER1  PIC 9(3).
        01 WS-NUMER2  PIC 9(3).
       PROCEDURE DIVISION.
            MOVE 15 TO WS-NUMER1.
            MOVE 25 TO WS-NUMER2.
            IF WS-NUMER1 IS GREATER THAN OR EQUAL TO WS-NUMER2 THEN
              DISPLAY "WS-NUMER1 IS GREATER THAN OR EQUAL WS-NEMER2"
            ELSE
              DISPLAY "NOT EQUAL".
            STOP RUN.
