       IDENTIFICATION DIVISION.
       PROGRAM-ID. RENMS01.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-DESCRIPTION.
         05 WS-NUM.
          10 WS-NUM1 PIC 9(2) VALUE 66.
          10 WS-NUM2 PIC 9(2) VALUE 64.
         05 WS-CHAR.
          10 WS-CHAR1 PIC X(2) VALUE 'HH'.
          10 WS-CHAR2 PIC X(2) VALUE 'AA'.
       66 WS-RENAME RENAMES WS-NUM2 THRU WS-CHAR2.
       PROCEDURE DIVISION.
            DISPLAY "WS-RENAME:" WS-RENAME.
            STOP RUN.
