       IDENTIFICATION DIVISION.
       PROGRAM-ID. SIGN01.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-NUM1 PIC S9(9) VALUE 1234.
       01 WS-NUM2 PIC S9(9) VALUE -123.
       PROCEDURE DIVISION.
            IF WS-NUM1 IS POSITIVE THEN
              DISPLAY " WS-NUM1 IS POSITIVE".
            IF WS-NUM2 IS NEGATIVE THEN
              DISPLAY " WS-NUM2 IS NEGATIVE".
            IF WS-NUM1 IS ZERO THEN
              DISPLAY " WS-NUM1 IS ZERO".
            STOP RUN.
