       IDENTIFICATION DIVISION.                                         
       PROGRAM-ID. SUM1.                                                
       ENVIRONMENT DIVISION.                                            
       DATA DIVISION.                                                   
       WORKING-STORAGE SECTION.                                         
       01   NUM1        PIC 99.                                         
       01   NUM2        PIC 99.                                         
       01   RESULT      PIC 999.                                        
       PROCEDURE DIVISION.                                              
       PROGRAM-BEGIN.                                                   
           ACCEPT NUM1.                                                 
           ACCEPT NUM2.                                                 
           COMPUTE RESULT = NUM1 + NUM2.                                
           DISPLAY RESULT.                                              
       PROGRAM-DONE.                                                    
            STOP RUN.                                                   
